{"keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "bias_constraint": null, "units": 64, "go_backwards": false, "bias_regularizer": null, "trainable": true, "batch_input_shape": [null, 1, 15], "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "name": "lstm_1", "implementation": 1, "kernel_regularizer": null, "use_bias": true, "return_sequences": true, "return_state": false, "activation": "tanh", "unroll": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "LSTM", "config": {"dtype": "float32", "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "bias_constraint": null, "units": 8, "go_backwards": false, "bias_regularizer": null, "trainable": true, "batch_input_shape": [null, 1, 15], "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "name": "lstm_2", "implementation": 1, "kernel_regularizer": null, "use_bias": true, "return_sequences": false, "return_state": false, "activation": "tanh", "unroll": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "units": 1, "bias_regularizer": null, "activation": "tanh", "trainable": true}}]}