{"config": [{"config": {"units": 64, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "return_sequences": true, "kernel_regularizer": null, "dtype": "float32", "unroll": false, "return_state": false, "recurrent_constraint": null, "name": "lstm_1", "unit_forget_bias": true, "bias_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "batch_input_shape": [null, 1, 7], "use_bias": true, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "dropout": 0.0, "implementation": 1, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"units": 8, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "return_sequences": false, "kernel_regularizer": null, "dtype": "float32", "unroll": false, "return_state": false, "recurrent_constraint": null, "name": "lstm_2", "unit_forget_bias": true, "bias_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "batch_input_shape": [null, 1, 7], "use_bias": true, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "dropout": 0.0, "implementation": 1, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"units": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow"}