{"config": [{"config": {"recurrent_dropout": 0.0, "bias_regularizer": null, "return_state": false, "return_sequences": true, "recurrent_constraint": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 64, "name": "lstm_1", "unroll": false, "kernel_regularizer": null, "dropout": 0.0, "batch_input_shape": [null, 1, 15], "trainable": true, "use_bias": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "implementation": 1, "stateful": false, "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "bias_regularizer": null, "return_state": false, "return_sequences": false, "recurrent_constraint": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 8, "name": "lstm_2", "unroll": false, "kernel_regularizer": null, "dropout": 0.0, "batch_input_shape": [null, 1, 15], "trainable": true, "use_bias": true, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "implementation": 1, "stateful": false, "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 1, "name": "dense_1", "activation": "tanh", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.5", "backend": "tensorflow"}