{"keras_version": "2.1.5", "config": [{"config": {"return_state": false, "name": "lstm_1", "batch_input_shape": [null, 1, 15], "trainable": true, "unroll": false, "dtype": "float32", "units": 64, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "recurrent_regularizer": null, "implementation": 1, "recurrent_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "dropout": 0.0, "kernel_constraint": null, "stateful": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "go_backwards": false, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"return_state": false, "name": "lstm_2", "batch_input_shape": [null, 1, 15], "trainable": true, "unroll": false, "dtype": "float32", "units": 8, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "recurrent_regularizer": null, "implementation": 1, "recurrent_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "dropout": 0.0, "kernel_constraint": null, "stateful": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "go_backwards": false, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "name": "dense_1", "trainable": true, "bias_constraint": null, "units": 1, "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}