{"config": [{"config": {"use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "units": 64, "batch_input_shape": [null, 1, 15], "dropout": 0.0, "go_backwards": false, "name": "lstm_1", "unit_forget_bias": true, "bias_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "return_sequences": true, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "implementation": 1, "unroll": false, "stateful": false, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "trainable": true, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "units": 8, "batch_input_shape": [null, 1, 15], "dropout": 0.0, "go_backwards": false, "name": "lstm_2", "unit_forget_bias": true, "bias_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "return_sequences": false, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "implementation": 1, "unroll": false, "stateful": false, "activity_regularizer": null, "activation": "tanh", "kernel_constraint": null, "trainable": true, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 1, "name": "dense_1", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "bias_regularizer": null, "activation": "tanh", "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.5"}