{"config": [{"config": {"activation": "tanh", "dropout": 0.0, "recurrent_dropout": 0.0, "bias_constraint": null, "unroll": false, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 1, 7], "trainable": true, "stateful": false, "return_state": false, "kernel_regularizer": null, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "recurrent_constraint": null, "name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "implementation": 1, "kernel_constraint": null, "units": 64, "dtype": "float32", "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"activation": "tanh", "dropout": 0.0, "recurrent_dropout": 0.0, "bias_constraint": null, "unroll": false, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 1, 7], "trainable": true, "stateful": false, "return_state": false, "kernel_regularizer": null, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "recurrent_constraint": null, "name": "lstm_2", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "implementation": 1, "kernel_constraint": null, "units": 8, "dtype": "float32", "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"activation": "tanh", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "units": 1, "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential"}