{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.5", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "go_backwards": false, "bias_regularizer": null, "units": 64, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "unit_forget_bias": true, "activation": "tanh", "return_sequences": true, "batch_input_shape": [null, 1, 25], "return_state": false, "dropout": 0.0, "recurrent_dropout": 0.0, "stateful": false, "implementation": 1, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "unroll": false, "trainable": true, "name": "lstm_1", "recurrent_activation": "hard_sigmoid"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "go_backwards": false, "bias_regularizer": null, "units": 8, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "unit_forget_bias": true, "activation": "tanh", "return_sequences": false, "batch_input_shape": [null, 1, 25], "return_state": false, "dropout": 0.0, "recurrent_dropout": 0.0, "stateful": false, "implementation": 1, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "unroll": false, "trainable": true, "name": "lstm_2", "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "units": 1, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "activation": "tanh", "trainable": true, "name": "dense_1"}}]}